# Дан список чисел. Определите, сколько в нем встречается различных чисел.
#     - Примечание. Эту задачу на Питоне можно решить в одну строчку.

print('\nВ введённом списке чисел, ', len(set(input('\nВведите список чисел:\t').split())), ' уникальных.')
