# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов.
# Используйте для решения задачи функцию `count`

s = str(input('\nВведите предложение:\t'))
i = ' '
print('\nВ введённом предложении -', s.count(i) + 1, 'слов(а).')
