# Вывести на консоль своё имя, нарисованное 'звёздочками'.
# Для выполнения этого задания надо использовать не только символы звёздочки и пробела, но и ESCAPE символы: \n и \t

print('\n', '~' * 65, '\n')
print('', '*' * 8, '  * \t\t', '*' * 8, '  *\t  *  ', '*' * 8, '  *\t  *\t\t*')
print(' *\t\t*\t*\t\t *\t\t\t*\t*\t  *\t\t\t *\t   *   *')
print(' *\t\t*\t*\t\t', '*' * 6, '\t* *\t\t ', '*' * 8, '  *\t\t* *\n *\t\t*   *\t\t *\t\t\t*\t*\t\t\t *\t *\t\t *')
print('', '*' * 8, ' ', '*' * 7, '', '*' * 8, '  *\t  *\t ', '*' * 8, '  *\t\t *\n\n', '~' * 65, '\n')
