# Написать программу, которая выводит в консоль таблицу Escape-последовательностей

print('~' * 40)
print('Escape sequences\n\\a\t\tBell  (alert)\n\\b\t\tBackspace\n\\n\t\tNew line\n\\t\t\tHorizontal tab')
print('\\\\\t\tBackslash \\\n\\\"\t\tDouble quotation mark "\n\\\'\t\tSingle quotation mark \'\n')
print('~' * 40)
